Catalogs/сабФинансовыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>сабФинансовыеПоказатели</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНаФорме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПромежуточныхЗначений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.сабСуммСред</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаЗнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаЧисло</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
								<v8:Type>cfg:CatalogRef.Д_СтатьиОборотки</v8:Type>
								<v8:Type>cfg:CatalogRef.сабФинансовыеПоказатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.сабТипыДанныхПоСчету</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОстатка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УЧ_ВидОстаткаПоСчету</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасшифровкаСубконто1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасшифровкаПоПредприятиям</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Знак</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасчетныеДанныеЗнаменатель</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
								<v8:Type>cfg:CatalogRef.Д_СтатьиОборотки</v8:Type>
								<v8:Type>cfg:CatalogRef.сабФинансовыеПоказатели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>cfg:EnumRef.сабТипыДанныхПоСчету</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОстатка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УЧ_ВидОстаткаПоСчету</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасшифровкаСубконто1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасшифровкаПоПредприятиям</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Знак</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccountingRegisters/Учетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccountingRegister>
		<Properties>
			<Name>Учетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Учетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Предприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПлана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКРХ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Крахмал</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиДок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/сабЗначенияФинПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>сабЗначенияФинПоказателей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сабФинансовыеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/УЧ_ВидОстаткаПоСчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>УЧ_ВидОстаткаПоСчету</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебет</Name>
					<Comment>Нам должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Мы должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДебетСвернутый</Name>
					<Comment>Нам должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитСвернутый</Name>
					<Comment>Мы должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДебетРазвернутый</Name>
					<Comment>Нам должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитРазвернутый</Name>
					<Comment>Мы должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДебетСвернутыйСубконто1</Name>
					<Comment>Нам должны</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредитСвернутыйСубконто1</Name>
					<Comment>Мы должны</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/сабТипыДанныхПоСчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>сабТипыДанныхПоСчету</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обороты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/сабСуммСред.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>сабСуммСред</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Среднее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Д_СтатьиОборотки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Д_СтатьиОборотки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазницаЧА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Счета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОстатка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УЧ_ВидОстаткаПоСчету</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасшифровкаСубконто1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасшифровкаПоПредприятиям</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/сабФинансовыеПоказатели/Ext/ManagerModule.bsl
Процедура ОбновитьНаСервере(Сценарий1, Период1, Предприятие) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Учетный.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ Счета
	               |ИЗ
	               |	ПланСчетов.Учетный КАК Учетный
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""СчетЧА""
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Д_СтатьиОборотки.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ СтатьяЧА
	               |ИЗ
	               |	Справочник.Д_СтатьиОборотки КАК Д_СтатьиОборотки
	               |ГДЕ
	               |	Д_СтатьиОборотки.РазницаЧА = ИСТИНА
	               |	И Д_СтатьиОборотки.Ссылка В ИЕРАРХИИ(&ВидСтатейБаланса)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Д_СтатьиОбороткиСчета.Ссылка КАК Статья,
	               |	Д_СтатьиОбороткиСчета.ВидОстатка КАК ВидОстатка,
	               |	Счета.Ссылка КАК Счет,
	               |	""БезЧА"" КАК ЧА,
	               |	Д_СтатьиОбороткиСчета.РасшифровкаСубконто1 КАК РасшифровкаСубконто1,
	               |	Д_СтатьиОбороткиСчета.РасшифровкаПоПредприятиям КАК РасшифровкаПоПредприятиям
	               |ПОМЕСТИТЬ ВТ_ИтогПоТЧСтатей
	               |ИЗ
	               |	Счета КАК Счета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Д_СтатьиОборотки.Счета КАК Д_СтатьиОбороткиСчета
	               |		ПО (Счета.Ссылка = Д_СтатьиОбороткиСчета.Счет
	               |				ИЛИ Счета.Ссылка.Родитель = Д_СтатьиОбороткиСчета.Счет
	               |				ИЛИ Счета.Ссылка.Родитель.Родитель = Д_СтатьиОбороткиСчета.Счет)
	               |ГДЕ
	               |	Д_СтатьиОбороткиСчета.Ссылка В ИЕРАРХИИ(&ВидСтатейБаланса)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СтатьяЧА.Ссылка,
	               |	Д_СтатьиОбороткиСчета.ВидОстатка,
	               |	Счета.Ссылка,
	               |	""ЧА"",
	               |	Д_СтатьиОбороткиСчета.РасшифровкаСубконто1,
	               |	Д_СтатьиОбороткиСчета.РасшифровкаПоПредприятиям
	               |ИЗ
	               |	Счета КАК Счета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Д_СтатьиОборотки.Счета КАК Д_СтатьиОбороткиСчета
	               |		ПО (Счета.Ссылка = Д_СтатьиОбороткиСчета.Счет
	               |				ИЛИ Счета.Ссылка.Родитель = Д_СтатьиОбороткиСчета.Счет
	               |				ИЛИ Счета.Ссылка.Родитель.Родитель = Д_СтатьиОбороткиСчета.Счет),
	               |	СтатьяЧА КАК СтатьяЧА
	               |ГДЕ
	               |	Д_СтатьиОбороткиСчета.Ссылка В ИЕРАРХИИ(&ВидСтатейБаланса)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ИтогПоТЧСтатей.Статья КАК Статья,
	               |	ВТ_ИтогПоТЧСтатей.ВидОстатка КАК ВидОстатка,
	               |	ВТ_ИтогПоТЧСтатей.Счет КАК Счет,
	               |	ВТ_ИтогПоТЧСтатей.ЧА КАК ЧА,
	               |	ВТ_ИтогПоТЧСтатей.РасшифровкаСубконто1 КАК РасшифровкаСубконто1,
	               |	ВТ_ИтогПоТЧСтатей.РасшифровкаПоПредприятиям КАК РасшифровкаПоПредприятиям
	               |ПОМЕСТИТЬ ВТ_ОбщаяСтатьиСчета
	               |ИЗ
	               |	ВТ_ИтогПоТЧСтатей КАК ВТ_ИтогПоТЧСтатей
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Д_СтатьиОборотки.Ссылка,
	               |	NULL,
	               |	NULL,
	               |	ВЫБОР
	               |		КОГДА Д_СтатьиОборотки.РазницаЧА
	               |			ТОГДА ""ЧА""
	               |		ИНАЧЕ ""БезЧА""
	               |	КОНЕЦ,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	Справочник.Д_СтатьиОборотки КАК Д_СтатьиОборотки
	               |ГДЕ
	               |	Д_СтатьиОборотки.Ссылка В ИЕРАРХИИ(&ВидСтатейБаланса)
	               |	И Д_СтатьиОборотки.ЭтоГруппа = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(ЕСТЬNULL(УчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт, 0)) КАК СНД,
	               |	СУММА(ЕСТЬNULL(УчетныйОстаткиИОбороты.СуммаНачальныйОстатокКт, 0)) КАК СНК,
	               |	СУММА(ЕСТЬNULL(УчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт, 0)) КАК СКД,
	               |	СУММА(ЕСТЬNULL(УчетныйОстаткиИОбороты.СуммаКонечныйОстатокКт, 0)) КАК СКК,
	               |	ВЫБОР
	               |		КОГДА &Сводный
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Предприятия.ПустаяСсылка)
	               |		ИНАЧЕ УчетныйОстаткиИОбороты.Предприятия
	               |	КОНЕЦ КАК Предприятия,
	               |	УчетныйОстаткиИОбороты.Счет КАК Счет,
	               |	СУММА(0) КАК СНДРС,
	               |	СУММА(0) КАК СНКРС,
	               |	СУММА(0) КАК СКДРС,
	               |	СУММА(0) КАК СККРС,
	               |	НЕОПРЕДЕЛЕНО КАК Субконто1,
	               |	УчетныйОстаткиИОбороты.Предприятия КАК Предприятие,
	               |	0 КАК ДО,
	               |	0 КАК КО
	               |ПОМЕСТИТЬ ВТ_ОстаткиПоСчетам
	               |ИЗ
	               |	РегистрБухгалтерии.Учетный.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			,
	               |			,
	               |			,
	               |			СценарийПлана = &Сценарий
	               |				И Предприятия В (&Предприятия)) КАК УчетныйОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних({(&ДатаКурса)}, ) КАК КурсыВалютСрезПоследних
	               |		ПО УчетныйОстаткиИОбороты.Предприятия.ОсновнаяВалютаУчета = КурсыВалютСрезПоследних.Валюта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних({(&ДатаКурса)}, Валюта = &ЭквивалентнаяВалюта) КАК КурсЭквивалентнойВалюты
	               |		ПО (УчетныйОстаткиИОбороты.Предприятия.ОсновнаяВалютаУчета = НЕОПРЕДЕЛЕНО)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	УчетныйОстаткиИОбороты.Счет,
	               |	ВЫБОР
	               |		КОГДА &Сводный
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Предприятия.ПустаяСсылка)
	               |		ИНАЧЕ УчетныйОстаткиИОбороты.Предприятия
	               |	КОНЕЦ,
	               |	УчетныйОстаткиИОбороты.Предприятия
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	ВЫБОР
	               |		КОГДА &Сводный
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Предприятия.ПустаяСсылка)
	               |		ИНАЧЕ УчетныйОстаткиИОбороты.Предприятия
	               |	КОНЕЦ,
	               |	УчетныйОстаткиИОбороты.Счет,
	               |	СУММА(ЕСТЬNULL(УчетныйОстаткиИОбороты.СуммаНачальныйРазвернутыйОстатокДт, 0)),
	               |	СУММА(ЕСТЬNULL(УчетныйОстаткиИОбороты.СуммаНачальныйРазвернутыйОстатокКт, 0)),
	               |	СУММА(ЕСТЬNULL(УчетныйОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокДт, 0)),
	               |	СУММА(ЕСТЬNULL(УчетныйОстаткиИОбороты.СуммаКонечныйРазвернутыйОстатокКт, 0)),
	               |	УчетныйОстаткиИОбороты.Субконто1,
	               |	УчетныйОстаткиИОбороты.Предприятия,
	               |	0,
	               |	0
	               |ИЗ
	               |	РегистрБухгалтерии.Учетный.ОстаткиИОбороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			,
	               |			,
	               |			,
	               |			СценарийПлана = &Сценарий
	               |				И Предприятия В (&Предприятия)) КАК УчетныйОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних({(&ДатаКурса)}, ) КАК КурсыВалютСрезПоследних
	               |		ПО УчетныйОстаткиИОбороты.Предприятия.ОсновнаяВалютаУчета = КурсыВалютСрезПоследних.Валюта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних({(&ДатаКурса)}, Валюта = &ЭквивалентнаяВалюта) КАК КурсЭквивалентнойВалюты
	               |		ПО (УчетныйОстаткиИОбороты.Предприятия.ОсновнаяВалютаУчета = НЕОПРЕДЕЛЕНО)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	УчетныйОстаткиИОбороты.Счет,
	               |	ВЫБОР
	               |		КОГДА &Сводный
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Предприятия.ПустаяСсылка)
	               |		ИНАЧЕ УчетныйОстаткиИОбороты.Предприятия
	               |	КОНЕЦ,
	               |	УчетныйОстаткиИОбороты.Субконто1,
	               |	УчетныйОстаткиИОбороты.Предприятия
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ВЫБОР
	               |		КОГДА &Сводный
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Предприятия.ПустаяСсылка)
	               |		ИНАЧЕ УчетныйОбороты.Предприятия
	               |	КОНЕЦ,
	               |	УчетныйОбороты.Счет,
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	СУММА(0),
	               |	НЕОПРЕДЕЛЕНО,
	               |	УчетныйОбороты.Предприятия,
	               |	ЕСТЬNULL(УчетныйОбороты.СуммаОборотДт, 0),
	               |	ЕСТЬNULL(УчетныйОбороты.СуммаОборотКт, 0)
	               |ИЗ
	               |	РегистрБухгалтерии.Учетный.Обороты(
	               |			&НачалоПериода,
	               |			&КонецПериода,
	               |			,
	               |			,
	               |			,
	               |			СценарийПлана = &Сценарий
	               |				И Предприятия В (&Предприятия),
	               |			НЕ КорСчет В ИЕРАРХИИ (&Счета9091),
	               |			) КАК УчетныйОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних({(&ДатаКурса)}, ) КАК КурсыВалютСрезПоследних
	               |		ПО УчетныйОбороты.Предприятия.ОсновнаяВалютаУчета = КурсыВалютСрезПоследних.Валюта
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних({(&ДатаКурса)}, Валюта = &ЭквивалентнаяВалюта) КАК КурсЭквивалентнойВалюты
	               |		ПО (УчетныйОбороты.Предприятия.ОсновнаяВалютаУчета = НЕОПРЕДЕЛЕНО)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	УчетныйОбороты.Счет,
	               |	ВЫБОР
	               |		КОГДА &Сводный
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.Предприятия.ПустаяСсылка)
	               |		ИНАЧЕ УчетныйОбороты.Предприятия
	               |	КОНЕЦ,
	               |	УчетныйОбороты.Предприятия,
	               |	ЕСТЬNULL(УчетныйОбороты.СуммаОборотДт, 0),
	               |	ЕСТЬNULL(УчетныйОбороты.СуммаОборотКт, 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОстаткиПоСчетам.Счет КАК Счет,
	               |	ВТ_ОстаткиПоСчетам.СНД КАК СуммаНачало,
	               |	ВТ_ОстаткиПоСчетам.СКД КАК СуммаКонец,
	               |	ЗНАЧЕНИЕ(Перечисление.УЧ_ВидОстаткаПоСчету.Дебет) КАК ВидОстатка,
	               |	ВТ_ОстаткиПоСчетам.Предприятия КАК Предприятия,
	               |	ВТ_ОстаткиПоСчетам.СНД КАК ЧАНачало,
	               |	ВТ_ОстаткиПоСчетам.СКД КАК ЧАКонец,
	               |	NULL КАК Субконто1,
	               |	ВТ_ОстаткиПоСчетам.Предприятие КАК Предприятие,
	               |	ВТ_ОстаткиПоСчетам.ДО КАК Оборот
	               |ПОМЕСТИТЬ ВТ_ОстаткиВидОстатка
	               |ИЗ
	               |	ВТ_ОстаткиПоСчетам КАК ВТ_ОстаткиПоСчетам
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ОстаткиПоСчетам.Счет,
	               |	ВТ_ОстаткиПоСчетам.СНК,
	               |	ВТ_ОстаткиПоСчетам.СКК,
	               |	ЗНАЧЕНИЕ(Перечисление.УЧ_ВидОстаткаПоСчету.Кредит),
	               |	ВТ_ОстаткиПоСчетам.Предприятия,
	               |	-ВТ_ОстаткиПоСчетам.СНК,
	               |	-ВТ_ОстаткиПоСчетам.СКК,
	               |	NULL,
	               |	ВТ_ОстаткиПоСчетам.Предприятие,
	               |	ВТ_ОстаткиПоСчетам.КО
	               |ИЗ
	               |	ВТ_ОстаткиПоСчетам КАК ВТ_ОстаткиПоСчетам
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ОстаткиПоСчетам.Счет,
	               |	ВТ_ОстаткиПоСчетам.СНД - ВТ_ОстаткиПоСчетам.СНК,
	               |	ВТ_ОстаткиПоСчетам.СКД - ВТ_ОстаткиПоСчетам.СКК,
	               |	ЗНАЧЕНИЕ(Перечисление.УЧ_ВидОстаткаПоСчету.ДебетСвернутый),
	               |	ВТ_ОстаткиПоСчетам.Предприятия,
	               |	ВТ_ОстаткиПоСчетам.СНД - ВТ_ОстаткиПоСчетам.СНК,
	               |	ВТ_ОстаткиПоСчетам.СКД - ВТ_ОстаткиПоСчетам.СКК,
	               |	NULL,
	               |	ВТ_ОстаткиПоСчетам.Предприятие,
	               |	ВТ_ОстаткиПоСчетам.ДО - ВТ_ОстаткиПоСчетам.КО
	               |ИЗ
	               |	ВТ_ОстаткиПоСчетам КАК ВТ_ОстаткиПоСчетам
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ОстаткиПоСчетам.Счет,
	               |	ВТ_ОстаткиПоСчетам.СНК - ВТ_ОстаткиПоСчетам.СНД,
	               |	ВТ_ОстаткиПоСчетам.СКК - ВТ_ОстаткиПоСчетам.СКД,
	               |	ЗНАЧЕНИЕ(Перечисление.УЧ_ВидОстаткаПоСчету.КредитСвернутый),
	               |	ВТ_ОстаткиПоСчетам.Предприятия,
	               |	-(ВТ_ОстаткиПоСчетам.СНК - ВТ_ОстаткиПоСчетам.СНД),
	               |	-(ВТ_ОстаткиПоСчетам.СКК - ВТ_ОстаткиПоСчетам.СКД),
	               |	NULL,
	               |	ВТ_ОстаткиПоСчетам.Предприятие,
	               |	ВТ_ОстаткиПоСчетам.КО - ВТ_ОстаткиПоСчетам.ДО
	               |ИЗ
	               |	ВТ_ОстаткиПоСчетам КАК ВТ_ОстаткиПоСчетам
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ОстаткиПоСчетам.Счет,
	               |	ВТ_ОстаткиПоСчетам.СНДРС,
	               |	ВТ_ОстаткиПоСчетам.СКДРС,
	               |	ЗНАЧЕНИЕ(Перечисление.УЧ_ВидОстаткаПоСчету.ДебетРазвернутый),
	               |	ВТ_ОстаткиПоСчетам.Предприятия,
	               |	ВТ_ОстаткиПоСчетам.СНДРС,
	               |	ВТ_ОстаткиПоСчетам.СКДРС,
	               |	ВТ_ОстаткиПоСчетам.Субконто1,
	               |	ВТ_ОстаткиПоСчетам.Предприятие,
	               |	ВТ_ОстаткиПоСчетам.ДО
	               |ИЗ
	               |	ВТ_ОстаткиПоСчетам КАК ВТ_ОстаткиПоСчетам
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ОстаткиПоСчетам.Счет,
	               |	ВТ_ОстаткиПоСчетам.СНКРС,
	               |	ВТ_ОстаткиПоСчетам.СККРС,
	               |	ЗНАЧЕНИЕ(Перечисление.УЧ_ВидОстаткаПоСчету.КредитРазвернутый),
	               |	ВТ_ОстаткиПоСчетам.Предприятия,
	               |	-ВТ_ОстаткиПоСчетам.СНКРС,
	               |	-ВТ_ОстаткиПоСчетам.СККРС,
	               |	ВТ_ОстаткиПоСчетам.Субконто1,
	               |	ВТ_ОстаткиПоСчетам.Предприятие,
	               |	ВТ_ОстаткиПоСчетам.КО
	               |ИЗ
	               |	ВТ_ОстаткиПоСчетам КАК ВТ_ОстаткиПоСчетам
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ОстаткиПоСчетам.Счет,
	               |	ВТ_ОстаткиПоСчетам.СНДРС - ВТ_ОстаткиПоСчетам.СНКРС,
	               |	ВТ_ОстаткиПоСчетам.СКДРС - ВТ_ОстаткиПоСчетам.СККРС,
	               |	ЗНАЧЕНИЕ(Перечисление.УЧ_ВидОстаткаПоСчету.ДебетСвернутыйСубконто1),
	               |	ВТ_ОстаткиПоСчетам.Предприятия,
	               |	ВТ_ОстаткиПоСчетам.СНДРС - ВТ_ОстаткиПоСчетам.СНКРС,
	               |	ВТ_ОстаткиПоСчетам.СКДРС - ВТ_ОстаткиПоСчетам.СККРС,
	               |	ВТ_ОстаткиПоСчетам.Субконто1,
	               |	ВТ_ОстаткиПоСчетам.Предприятие,
	               |	ВТ_ОстаткиПоСчетам.ДО - ВТ_ОстаткиПоСчетам.КО
	               |ИЗ
	               |	ВТ_ОстаткиПоСчетам КАК ВТ_ОстаткиПоСчетам
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ОстаткиПоСчетам.Счет,
	               |	ВТ_ОстаткиПоСчетам.СНКРС - ВТ_ОстаткиПоСчетам.СНДРС,
	               |	ВТ_ОстаткиПоСчетам.СККРС - ВТ_ОстаткиПоСчетам.СКДРС,
	               |	ЗНАЧЕНИЕ(Перечисление.УЧ_ВидОстаткаПоСчету.КредитСвернутыйСубконто1),
	               |	ВТ_ОстаткиПоСчетам.Предприятия,
	               |	-(ВТ_ОстаткиПоСчетам.СНКРС - ВТ_ОстаткиПоСчетам.СНДРС),
	               |	-(ВТ_ОстаткиПоСчетам.СККРС - ВТ_ОстаткиПоСчетам.СКДРС),
	               |	ВТ_ОстаткиПоСчетам.Субконто1,
	               |	ВТ_ОстаткиПоСчетам.Предприятие,
	               |	ВТ_ОстаткиПоСчетам.КО - ВТ_ОстаткиПоСчетам.ДО
	               |ИЗ
	               |	ВТ_ОстаткиПоСчетам КАК ВТ_ОстаткиПоСчетам
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОстаткиВидОстатка.Счет КАК Счет,
	               |	ВТ_ОстаткиВидОстатка.СуммаНачало КАК СуммаНачало,
	               |	ВТ_ОстаткиВидОстатка.СуммаКонец КАК СуммаКонец,
	               |	ВТ_ОстаткиВидОстатка.Предприятия КАК Предприятия,
	               |	ВТ_ОстаткиВидОстатка.Субконто1 КАК Субконто1,
	               |	ВТ_ОстаткиВидОстатка.ВидОстатка КАК ВидОстатка,
	               |	""БезЧА"" КАК ЧА,
	               |	ВТ_ОстаткиВидОстатка.Предприятие КАК Предприятие,
	               |	ВТ_ОстаткиВидОстатка.Оборот КАК Оборот
	               |ПОМЕСТИТЬ ВТ_ИтоговоеСальдо
	               |ИЗ
	               |	ВТ_ОстаткиВидОстатка КАК ВТ_ОстаткиВидОстатка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ИтоговоеСальдо.Счет КАК Счет,
	               |	ВТ_ИтоговоеСальдо.СуммаНачало КАК СуммаНачало,
	               |	ВТ_ИтоговоеСальдо.СуммаКонец КАК СуммаКонец,
	               |	ВТ_ИтоговоеСальдо.Предприятия КАК Предприятия,
	               |	ВЫБОР
	               |		КОГДА &Сводный = ЛОЖЬ
	               |				И ВТ_ОбщаяСтатьиСчета.РасшифровкаСубконто1 = ИСТИНА
	               |			ТОГДА ВТ_ИтоговоеСальдо.Субконто1
	               |		ИНАЧЕ NULL
	               |	КОНЕЦ КАК Субконто1,
	               |	ВТ_ОбщаяСтатьиСчета.Статья КАК Статья,
	               |	ВЫБОР
	               |		КОГДА &Сводный = ИСТИНА
	               |				И ВТ_ОбщаяСтатьиСчета.РасшифровкаПоПредприятиям = ИСТИНА
	               |			ТОГДА ВТ_ИтоговоеСальдо.Предприятие
	               |		ИНАЧЕ NULL
	               |	КОНЕЦ КАК Предприятие,
	               |	ВТ_ИтоговоеСальдо.Оборот КАК Оборот
	               |ИЗ
	               |	ВТ_ОбщаяСтатьиСчета КАК ВТ_ОбщаяСтатьиСчета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговоеСальдо КАК ВТ_ИтоговоеСальдо
	               |		ПО ВТ_ОбщаяСтатьиСчета.Счет = ВТ_ИтоговоеСальдо.Счет
	               |			И ВТ_ОбщаяСтатьиСчета.ВидОстатка = ВТ_ИтоговоеСальдо.ВидОстатка
	               |			И ВТ_ОбщаяСтатьиСчета.ЧА = ВТ_ИтоговоеСальдо.ЧА
	               |ГДЕ
	               |	(НЕ ЕСТЬNULL(ВТ_ИтоговоеСальдо.СуммаНачало, 0) = 0
	               |			ИЛИ НЕ ЕСТЬNULL(ВТ_ИтоговоеСальдо.СуммаКонец, 0) = 0)";
	
	Запрос.УстановитьПараметр("Сводный", ЗначениеЗаполнено(Предприятие));
	Запрос.УстановитьПараметр("ВидСтатейБаланса", Справочники.Д_СтатьиОборотки.НайтиПоНаименованию("Статьи учетного баланса", Истина));
	Запрос.УстановитьПараметр("ЭквивалентнаяВалюта", УЧ_Сервер.НациональнаяВалюта());
	Запрос.УстановитьПараметр("ДатаКурса", Период1.ДатаНачала);
	Запрос.УстановитьПараметр("Предприятия", ?(НЕ ЗначениеЗаполнено(Предприятие), БюджетныйНаСервере.ПолучитьПредприятия(), Предприятие));
	Запрос.УстановитьПараметр("Сценарий", Сценарий1);
	Запрос.УстановитьПараметр("НачалоПериода", Период1.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период1.ДатаОкончания);
	Счета9091 = Новый Массив;
	Счета9091.Добавить(ПланыСчетов.Учетный.Счет90());
	Счета9091.Добавить(ПланыСчетов.Учетный.Счет91());
	Счета9091.Добавить(ПланыСчетов.Учетный.Счет99());
	Запрос.УстановитьПараметр("Счета9091", Счета9091);
	
	Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	ВыборкаДанныеБаланса = Результат[7].Выгрузить();
	
	Оборот = Перечисления.сабТипыДанныхПоСчету.Обороты;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	сабФинансовыеПоказатели.Ссылка КАК Ссылка,
	               |	сабФинансовыеПоказатели.РасчетныеДанные.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Источник КАК Источник,
	               |		ТипДанных КАК ТипДанных,
	               |		ВидОстатка КАК ВидОстатка,
	               |		РасшифровкаСубконто1 КАК РасшифровкаСубконто1,
	               |		РасшифровкаПоПредприятиям КАК РасшифровкаПоПредприятиям
	               |	) КАК РасчетныеДанные,
	               |	сабФинансовыеПоказатели.РасчетныеДанныеЗнаменатель.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Источник КАК Источник,
	               |		ТипДанных КАК ТипДанных,
	               |		ВидОстатка КАК ВидОстатка,
	               |		РасшифровкаСубконто1 КАК РасшифровкаСубконто1,
	               |		РасшифровкаПоПредприятиям КАК РасшифровкаПоПредприятиям
	               |	) КАК РасчетныеДанныеЗнаменатель
	               |ИЗ
	               |	Справочник.сабФинансовыеПоказатели КАК сабФинансовыеПоказатели";
	
	РезультатСтатьи = Запрос.Выполнить();
	Выборка = РезультатСтатьи.Выбрать();
	
	МассивПоказателей = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		ПоказательРассчитан = Ложь;
		ТекЗначение1 = 0;
		ТекЗначение2 = 0;
		ВыборкаТЧ = Выборка.РасчетныеДанные.Выгрузить();
		Для каждого ТекСтрокаФин Из ВыборкаТЧ Цикл
			Если Не ТипЗнч(ТекСтрокаФин.Источник) = Тип("СправочникСсылка.Д_СтатьиОборотки") Тогда
				Продолжить;			
			КонецЕсли;
			НайденныеСтроки = ВыборкаДанныеБаланса.НайтиСтроки(Новый Структура("Статья", ТекСтрокаФин.Источник));
			Для каждого ТекСтрока Из НайденныеСтроки Цикл
				Если ТекСтрокаФин.ТипДанных = Оборот Тогда
					ТекЗначение1 = ТекЗначение1 + ТекСтрока.Оборот;
				Иначе
					ТекЗначение1 = ТекЗначение1 + ТекСтрока.СуммаНачало;
					ТекЗначение2 = ТекЗначение2 + ТекСтрока.СуммаКонец;
				КонецЕсли;
			КонецЦикла;
			ПоказательРассчитан = Истина;
		КонецЦикла;
		
		Если ПоказательРассчитан Тогда
			МассивПоказателей.Добавить(Выборка.Ссылка);		
		КонецЕсли;
		
		НоваяЗапись = РегистрыСведений.сабЗначенияФинПоказателей.СоздатьМенеджерЗаписи();
		НоваяЗапись.Сценарий = Сценарий1;
		НоваяЗапись.Показатель = Выборка.Ссылка;
		НоваяЗапись.Предприятие = Предприятие;
		НоваяЗапись.Период = Период1.ДатаНачала;
		НоваяЗапись.Значение = ТекЗначение1;
		НоваяЗапись.Записать();
		
		НоваяЗапись = РегистрыСведений.сабЗначенияФинПоказателей.СоздатьМенеджерЗаписи();
		НоваяЗапись.Сценарий = Сценарий1;
		НоваяЗапись.Показатель = Выборка.Ссылка;
		НоваяЗапись.Предприятие = Предприятие;
		НоваяЗапись.Период = Период1.ДатаОкончания;
		НоваяЗапись.Значение = ТекЗначение2;
		НоваяЗапись.Записать();
		
	КонецЦикла;
	
	ВыборкаДанныеСчетов = Результат[6].Выгрузить();
	
	Выборка = РезультатСтатьи.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не МассивПоказателей.Найти(Выборка.Ссылка) = Неопределено Тогда
			Продолжить;		
		КонецЕсли;
		
		ТекЗначение1 = 0;
		ТекЗначение2 = 0;
		ПоказательРассчитан = Ложь;
		ВыборкаТЧ = Выборка.РасчетныеДанные.Выгрузить();
		Для каждого ТекСтрокаФин Из ВыборкаТЧ Цикл
			Если Не ТипЗнч(ТекСтрокаФин.Источник) = Тип("ПланСчетовСсылка.Учетный") Тогда
				Продолжить;			
			КонецЕсли;
			НайденныеСтроки = ВыборкаДанныеСчетов.НайтиСтроки(Новый Структура("Счет, ВидОстатка", ТекСтрокаФин.Источник, ТекСтрокаФин.ВидОстатка));
			Для каждого ТекСтрока Из НайденныеСтроки Цикл
				Если ТекСтрокаФин.ТипДанных = Оборот Тогда
					ТекЗначение1 = ТекЗначение1 + ТекСтрока.Оборот;
				Иначе
					ТекЗначение1 = ТекЗначение1 + ТекСтрока.СуммаНачало;
					ТекЗначение2 = ТекЗначение2 + ТекСтрока.СуммаКонец;
				КонецЕсли;
			КонецЦикла;
			ПоказательРассчитан = Истина;
		КонецЦикла;
		
		Если ПоказательРассчитан Тогда
			МассивПоказателей.Добавить(Выборка.Ссылка);		
		КонецЕсли;
		
		НоваяЗапись = РегистрыСведений.сабЗначенияФинПоказателей.СоздатьМенеджерЗаписи();
		НоваяЗапись.Сценарий = Сценарий1;
		НоваяЗапись.Показатель = Выборка.Ссылка;
		НоваяЗапись.Предприятие = Предприятие;
		НоваяЗапись.Период = Период1.ДатаНачала;
		НоваяЗапись.Значение = ТекЗначение1;
		НоваяЗапись.Записать();
		
		НоваяЗапись = РегистрыСведений.сабЗначенияФинПоказателей.СоздатьМенеджерЗаписи();
		НоваяЗапись.Сценарий = Сценарий1;
		НоваяЗапись.Показатель = Выборка.Ссылка;
		НоваяЗапись.Предприятие = Предприятие;
		НоваяЗапись.Период = Период1.ДатаОкончания;
		НоваяЗапись.Значение = ТекЗначение2;
		НоваяЗапись.Записать();
		
	КонецЦикла;
	
	//расчитываем относительные показатели
	Суммовой = Перечисления.сабСуммСред.Сумма;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	сабФинансовыеПоказатели.Ссылка КАК Показатель,
	               |	СУММА(ЕСТЬNULL(сабЗначенияФинПоказателей.Значение, 0)) КАК ЗначениеСумм,
	               |	СРЕДНЕЕ(ЕСТЬNULL(сабЗначенияФинПоказателей.Значение, 0)) КАК ЗначениеСред,
	               |	сабФинансовыеПоказатели.ПоказыватьНаФорме КАК ПоказыватьНаФорме,
	               |	сабФинансовыеПоказатели.РасчетПромежуточныхЗначений КАК РасчетПромежуточныхЗначений
	               |ИЗ
	               |	Справочник.сабФинансовыеПоказатели КАК сабФинансовыеПоказатели
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.сабЗначенияФинПоказателей КАК сабЗначенияФинПоказателей
	               |		ПО сабФинансовыеПоказатели.Ссылка = сабЗначенияФинПоказателей.Показатель
	               |			И (сабЗначенияФинПоказателей.Период МЕЖДУ &ДатаНачала И &ДатаОкончания)
	               |			И (сабЗначенияФинПоказателей.Сценарий = &Сценарий)
	               |			И (сабЗначенияФинПоказателей.Предприятие = &Предприятие)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	сабФинансовыеПоказатели.Ссылка,
	               |	сабФинансовыеПоказатели.ПоказыватьНаФорме,
	               |	сабФинансовыеПоказатели.РасчетПромежуточныхЗначений";
	
	Запрос.УстановитьПараметр("Сценарий", Сценарий1);
	Запрос.УстановитьПараметр("ДатаНачала", Период1.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период1.ДатаОкончания);
	Запрос.УстановитьПараметр("Предприятие", Предприятие);
	
	Результат = Запрос.Выполнить();
	ВыборкаЗначенияПоказателей = Результат.Выгрузить();
	
	Для каждого ТекСтрока Из ВыборкаЗначенияПоказателей Цикл
		Если НЕ ТекСтрока.РасчетПромежуточныхЗначений = Суммовой Тогда
			ТекСтрока.ЗначениеСумм = ТекСтрока.ЗначениеСред;
		КонецЕсли;
	КонецЦикла;
	
	Выборка = РезультатСтатьи.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не МассивПоказателей.Найти(Выборка.Ссылка) = Неопределено Тогда
			Продолжить;		
		КонецЕсли;
		
		ТекЗначение1 = 0;
		ВыборкаТЧ = Выборка.РасчетныеДанные.Выгрузить();
		Для каждого ТекСтрокаФин Из ВыборкаТЧ Цикл
			Если Не ТипЗнч(ТекСтрокаФин.Источник) = Тип("СправочникСсылка.сабФинансовыеПоказатели") Тогда
				Продолжить;			
			КонецЕсли;
			НайденныеСтроки = ВыборкаЗначенияПоказателей.НайтиСтроки(Новый Структура("Показатель", ТекСтрокаФин.Источник));
			Для каждого ТекСтрока Из НайденныеСтроки Цикл
				ТекЗначение1 = ТекЗначение1 + ТекСтрока.ЗначениеСумм;
			КонецЦикла;
		КонецЦикла;
		
		ТекЗначение2 = 0;
		ЕстьЗнаменатель = Ложь;
		ВыборкаТЧЗнаменатели = Выборка.РасчетныеДанныеЗнаменатель.Выгрузить();
		Для каждого ТекСтрокаФин Из ВыборкаТЧЗнаменатели Цикл
			Если Не ТипЗнч(ТекСтрокаФин.Источник) = Тип("СправочникСсылка.сабФинансовыеПоказатели") Тогда
				Продолжить;			
			КонецЕсли;
			НайденныеСтроки = ВыборкаЗначенияПоказателей.НайтиСтроки(Новый Структура("Показатель", ТекСтрокаФин.Источник));
			Для каждого ТекСтрока Из НайденныеСтроки Цикл
				ТекЗначение2 = ТекЗначение2 + ТекСтрока.ЗначениеСумм;
			КонецЦикла;
			ЕстьЗнаменатель = Истина;
		КонецЦикла;

		НоваяЗапись = РегистрыСведений.сабЗначенияФинПоказателей.СоздатьМенеджерЗаписи();
		НоваяЗапись.Сценарий = Сценарий1;
		НоваяЗапись.Показатель = Выборка.Ссылка;
		НоваяЗапись.Предприятие = Предприятие;
		НоваяЗапись.Период = Период1.ДатаНачала;
		НоваяЗапись.Значение = ?(ЕстьЗнаменатель, Формат(?(ТекЗначение2, ТекЗначение1 / ТекЗначение2, 0), "ЧДЦ=2"), ТекЗначение1);
		НоваяЗапись.Записать();
		
		НоваяЗапись = РегистрыСведений.сабЗначенияФинПоказателей.СоздатьМенеджерЗаписи();
		НоваяЗапись.Сценарий = Сценарий1;
		НоваяЗапись.Показатель = Выборка.Ссылка;
		НоваяЗапись.Предприятие = Предприятие;
		НоваяЗапись.Период = Период1.ДатаОкончания;
		НоваяЗапись.Значение = ?(ЕстьЗнаменатель, Формат(?(ТекЗначение2, ТекЗначение1 / ТекЗначение2, 0), "ЧДЦ=2"), ТекЗначение1);
		НоваяЗапись.Записать();

	КонецЦикла;
		
КонецПроцедуры
